In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range("20130101", periods=6)
dates
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.801858  1.093851  0.394193 -0.131285
2013-01-02  0.389310  0.335550  0.110095  1.558805
2013-01-03 -0.217436  0.604491  1.632334  1.428483
2013-01-04  0.370907  0.080817 -2.286044 -0.627518
2013-01-05 -0.169712  1.962850 -0.516293  0.671035
2013-01-06  0.051819 -2.000043 -0.777776  0.729720

In [9]:
#Load the data from team.csv into a DataFrame
team = pd.read_csv("team.csv")

#display all the data
team

,Name,Age,Occupation,Favorite Color,Number of Socks,Owns a Unicorn
0,Bartholomew,27,Cloud Architect,Electric Lime,17,False
1,Celeste,32,Professional Tea Taster,Mango,12,True
2,Ferdinand,102,Time Traveler,Invisible,3,False
3,Hermione,16,Mermaid Trainer,Glitter,42,True
4,Quincy,4,Professional Nap-Taker,Rainbow,0,False

In [10]:
#display first 3 rows
team.head(3)

,Name,Age,Occupation,Favorite Color,Number of Socks,Owns a Unicorn
0,Bartholomew,27,Cloud Architect,Electric Lime,17,False
1,Celeste,32,Professional Tea Taster,Mango,12,True
2,Ferdinand,102,Time Traveler,Invisible,3,False

In [11]:
#display age only
team["Age"]

0     27
1     32
2    102
3     16
4      4
Name: Age, dtype: int64

In [17]:
#average number of socks
team["Age"].mean()

np.float64(36.2)

In [25]:
# any row where occupation is time traveller
team.loc[team["Occupation"]=="Time Traveler"]

,Name,Age,Occupation,Favorite Color,Number of Socks,Owns a Unicorn
2,Ferdinand,102,Time Traveler,Invisible,3,False

In [26]:
melb = pd.read_csv("melb_data.csv")
melb.head(4)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0

In [30]:
y = melb.Price
melbourne_features = ['Rooms', 'Bathroom', 'Landsize', 'Lattitude', 'Longtitude']
X = melb[melbourne_features]

X
y

0        1480000.0
1        1035000.0
2        1465000.0
3         850000.0
4        1600000.0
           ...
13575    1245000.0
13576    1031000.0
13577    1170000.0
13578    2500000.0
13579    1285000.0
Name: Price, Length: 13580, dtype: float64

In [31]:
from sklearn.tree import DecisionTreeRegressor

# Define model. 
# Specify a number for random_state to ensure same results each run
melbourne_model = DecisionTreeRegressor(random_state=1)

# Fit model
melbourne_model.fit(X, y)

print("Making predictions for the following 5 houses:")
print(X.head())
print("The predictions are")
print(melbourne_model.predict(X.head()))
print(y.head())

Making predictions for the following 5 houses:
   Rooms  Bathroom  Landsize  Lattitude  Longtitude
0      2       1.0     202.0   -37.7996    144.9984
1      2       1.0     156.0   -37.8079    144.9934
2      3       2.0     134.0   -37.8093    144.9944
3      3       2.0      94.0   -37.7969    144.9969
4      4       1.0     120.0   -37.8072    144.9941
The predictions are
[1480000. 1035000. 1465000.  850000. 1600000.]
0    1480000.0
1    1035000.0
2    1465000.0
3     850000.0
4    1600000.0
Name: Price, dtype: float64

In [33]:
from sklearn.metrics import mean_absolute_error

predicted_home_prices = melbourne_model.predict(X)
mean_absolute_error(y, predicted_home_prices)

61913.91237113402

In [34]:
from sklearn.model_selection import train_test_split

# split data into training and validation data, for both features and target
# The split is based on a random number generator. Supplying a numeric value to
# the random_state argument guarantees we get the same split every time we
# run this script.
train_X, val_X, train_y, val_y = train_test_split(X, y, random_state = 0)
# Define model
melbourne_model = DecisionTreeRegressor()
# Fit model
melbourne_model.fit(train_X, train_y)

# get predicted prices on validation data
val_predictions = melbourne_model.predict(val_X)
print(mean_absolute_error(val_y, val_predictions))

248670.87638684336